 # Big Data Engineering with Python
 `by คอลิด ลังสารี Kholed Langsari`

# Demo -  Sakila Star Schema & ETL in 6 Steps

All the database tables in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design

In [1]:
# In case your env does not have the needed libraries
# !pip install psycopg2-binary
# !pip install ipython-sql
# !pip install pandas

# STEP0: Using ipython-sql

- Load ipython-sql: `%load_ext sql`
    - install ipython-sql 0.4.0 `pip install ipython-sql`

- To execute SQL queries you write one of the following atop of your cell: 
    - `%sql`
        - For a one-liner SQL query
        - You can access a python var using `$`    
    - `%%sql`
        - For a multi-line SQL query
        - You can **NOT** access a python var using `$`


- Running a connection string like:
`postgresql://postgres:postgres@db:5432/pagila` connects to the database

# STEP1 : Connect to the local database where Pagila is loaded

##  1.1 Create the pagila db and fill it with data
- Adding `"!"` at the beginning of a jupyter cell runs a command in a shell, i.e. we are not running python code but we are running the `createdb` and `psql` postgresql commmand-line utilities

In [2]:
# !PGPASSWORD=admin createdb -h 127.0.0.1 -U postgres pagila
# !PGPASSWORD=admin psql -q -h 127.0.0.1 -U postgres -d pagila -f Data/pagila-schema.sql
# !PGPASSWORD=admin psql -q -h 127.0.0.1 -U postgres -d pagila -f Data/pagila-data.sql

## 1.2 Connect to the newly created db

In [3]:
%load_ext sql

In [4]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'admin'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:admin@127.0.0.1:5432/pagila

In [5]:
%sql $conn_string

/Users/kholed/anaconda3/lib/python3.7/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

# STEP2 : Explore the  3NF Schema

<img src="images/pagila-3nf.png" width="70%"/>

## 2.1 How much? What data sizes are we looking at?

In [6]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t\t=", nCountry[0][0])

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry		= 109

## 2.2 When? What time period are we talking about?

In [7]:
%%sql 
select min(rental_date) as start, max(rental_date) as end from rental;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2005, 5, 25, 4, 53, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), datetime.datetime(2020, 2, 14, 22, 16, 3, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)))]

In [8]:
%%sql 
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2020, 1, 25, 4, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), datetime.datetime(2020, 5, 14, 19, 44, 29, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)))]

## 2.3 Where? Where do events in this database occur?
TODO: Write a query that displays the number of addresses by district in the address table. Limit the table to the top 10 districts.

In [9]:
%%sql
select district, sum(city_id) as n
from address
group by district
order by n desc
limit 10 ;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790)]

In [10]:
%%sql
select district, count(1)
from address
group by district
order by count(1) desc
limit 10

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

# STEP3: Perform some simple data analysis

### 3NF - Entity Relationship Diagram

<img src="images/pagila-3nf.png" width="70%"/>

## 3.1 Insight 1:   Top Grossing Movies 
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

### 3.1.1 Films

In [12]:
%%sql
select film_id, title, release_year, rental_rate, rating  from film limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

### 3.1.2 Payments

In [13]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2020, 1, 25, 4, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2020, 1, 25, 22, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2020, 1, 29, 4, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2020, 1, 29, 7, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2020, 1, 29, 15, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)))]

### 3.1.3 Inventory

In [14]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2020, 2, 15, 17, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (2, 1, 1, datetime.datetime(2020, 2, 15, 17, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (3, 1, 1, datetime.datetime(2020, 2, 15, 17, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (4, 1, 1, datetime.datetime(2020, 2, 15, 17, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None))),
 (5, 1, 2, datetime.datetime(2020, 2, 15, 17, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)))]

### 3.1.4 Get the movie of every payment

In [15]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2020, 1, 25, 4, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2020, 1, 25, 22, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2020, 1, 29, 4, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2020, 1, 29, 7, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2020, 1, 29, 15, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), 269)]

### 3.1.5 sum movie rental revenue
TODO: Write a query that displays the amount of revenue from each title. Limit the results to the top 10 grossing titles.

In [16]:
%%sql
SELECT f.title, sum(p.amount) as revenue                                           
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
group by f.title
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

Congratulation, you have run up to step 3

## 3.2 Insight 2:   Top grossing cities 
- Payments amounts are in table `payment`
- Cities are in table `cities`
- `payment` &rarr; `customer` &rarr; `address` &rarr; `city`

### 3.2.1 Get the city of each payment

In [17]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city                            
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

### 3.2.2 Top grossing cities
TODO: Write a query that returns the total amount of revenue by city as measured by the `amount` variable in the `payment` table. Limit the results to the top 10 cities.

In [19]:
%%sql
SELECT ci.city,sum(p.amount) as revenue
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by ci.city
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

## 3.3 Insight 3 : Revenue of a movie by customer city and by month

### 3.3.1 Total revenue by month

In [20]:
%%sql
SELECT sum(p.amount) as revenue, EXTRACT(month FROM p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(Decimal('27226.52'), Decimal('4')),
 (Decimal('23886.56'), Decimal('3')),
 (Decimal('9745.61'), Decimal('2')),
 (Decimal('4710.70'), Decimal('1')),
 (Decimal('1847.12'), Decimal('5'))]

### 3.3.2 Each movie by customer city and by month (data cube)

In [21]:
%%sql
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date,EXTRACT(month FROM p.payment_date) as month
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2020, 1, 25, 4, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2020, 1, 25, 4, 22, 59, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2020, 1, 25, 4, 32, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2020, 1, 25, 4, 33, 7, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2020, 1, 25, 4, 33, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2020, 1, 25, 4, 36, 33, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2020, 1, 25, 4, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2020, 1, 25, 5, 0, 12, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2020, 1, 25, 5, 29, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1')),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2020, 1, 25, 5, 30, 47, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=420, name=None)), Decimal('1'))]

### 3.3.3 Sum of revenue of each movie by customer city and by month

TODO: Write a query that returns the total amount of revenue for each movie by customer city and by month. Limit the results to the top 10 movies.

In [22]:
%%sql
SELECT f.title, ci.city, EXTRACT(month FROM p.payment_date) as month,sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by f.title, ci.city, month
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('EAGLES PANKY', 'Datong', Decimal('3'), Decimal('16.98')),
 ('CARIBBEAN LIBERTY', 'Ibirit', Decimal('4'), Decimal('16.98')),
 ('LUST LOCK', 'Coatzacoalcos', Decimal('4'), Decimal('15.98')),
 ('INNOCENT USUAL', 'Valparai', Decimal('2'), Decimal('13.98')),
 ('BREAKFAST GOLDFINGER', 'Ife', Decimal('4'), Decimal('13.98')),
 ('VIRGIN DAISY', 'Cam Ranh', Decimal('4'), Decimal('12.98')),
 ('SLEEPLESS MONSOON', 'Fuyu', Decimal('4'), Decimal('12.98')),
 ('TITANIC BOONDOCK', 'Sumqayit', Decimal('4'), Decimal('12.98')),
 ('MIDSUMMER GROUNDHOG', 'Szkesfehrvr', Decimal('4'), Decimal('11.99')),
 ('SCORPION APOLLO', 'Osmaniye', Decimal('4'), Decimal('11.99'))]

# STEP4 : Creating Facts & Dimensions

### Star Schema - Entity Relationship Diagram

<img src="images/pagila-star.png" width="50%"/>

#### Create the first dimension table
TODO: Create the dimDate dimension table with the fields and data types shown in the ERD above.

In [39]:
%%sql
CREATE TABLE dimDate
(
  date_key serial PRIMARY KEY,
  date date NOT NULL,
  year smallint NOT NULL,
  quarter smallint NOT NULL,
  month smallint NOT NULL,
  day smallint NOT NULL,
  week smallint NOT NULL,
  is_weekend boolean
);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.

[]

To check your work, run the following query to see a table with the field names and data types.

In [24]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'dimdate'

 * postgresql://postgres:***@127.0.0.1:5432/pagila
8 rows affected.

[('date_key', 'integer'),
 ('date', 'date'),
 ('year', 'smallint'),
 ('quarter', 'smallint'),
 ('month', 'smallint'),
 ('day', 'smallint'),
 ('week', 'smallint'),
 ('is_weekend', 'boolean')]

Run the cell below to create the rest of the dimension tables.

In [40]:
%%sql
CREATE TABLE dimCustomer
(
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE dimMovie
(
  movie_key          SERIAL PRIMARY KEY,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE dimStore
(
  store_key           SERIAL PRIMARY KEY,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.
Done.
Done.

[]

#### Create the fact table
TODO: Create the factSales table with the fields and data types shown in the ERD above.

In [41]:
%%sql
CREATE TABLE factSales
(
  sales_key serial PRIMARY KEY,
  date_key integer REFERENCES dimdate (date_key),
  customer_key integer REFERENCES dimcustomer (customer_key),
  movie_key integer REFERENCES dimmovie (movie_key),
  store_key integer REFERENCES dimstore (store_key),
  sales_amount numeric    
);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.

[]

To check your work, run the following query to see a table with the field names and data types.

In [27]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'factsales'

 * postgresql://postgres:***@127.0.0.1:5432/pagila
6 rows affected.

[('sales_key', 'integer'),
 ('date_key', 'integer'),
 ('customer_key', 'integer'),
 ('movie_key', 'integer'),
 ('store_key', 'integer'),
 ('sales_amount', 'numeric')]

If you need to delete the table and start over, use the DROP TABLE command: `DROP TABLE <table_name>`

In [38]:
%%sql
--DROP TABLE factsales;
--DROP TABLE dimStore;
--DROP TABLE dimMovie;
--DROP TABLE dimCustomer;
--DROP TABLE dimDate;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.
Done.
Done.

[]

Congratulation, you have done up to step 4

# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table

In [42]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [43]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [44]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2020, 1, 25, 4, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2020, 1, 25, 22, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2020, 1, 29, 4, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2020, 1, 29, 7, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2020, 1, 29, 15, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [ ]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="images/pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="images/pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go Step 4 and recreate the tables.

In [45]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
41 rows affected.

[]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [46]:
%%sql
INSERT INTO dimCustomer (customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, 
                         active, create_date, start_date, end_date)
SELECT DISTINCT c.customer_id, 
                c.first_name, 
                c.last_name, 
                c.email, 
                a.address, 
                a.address2, 
                a.district, 
                ci.city, 
                co.country, 
                a.postal_code, 
                a.phone, 
       CASE WHEN c.activebool  THEN 1 ELSE 0 END, 
        (cast(c.create_date as text) || ' 00:00:01'):: timestamp, 
                date(now()) AS start_date, date(now())
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id)
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide

In [47]:
%%sql
INSERT INTO dimMovie (film_id, title, description, release_year, language,
                     original_language, rental_duration, length, rating,
                     special_features)
SELECT DISTINCT f.film_id, f.title, f.description, f.release_year, l.name,
                     orig_lang.name, f.rental_duration, f.length, f.rating,
                     f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [48]:
%%sql
INSERT INTO dimStore (store_id, address, address2, district, city, country, postal_code,
                     manager_first_name, manager_last_name, start_date, end_date)
SELECT DISTINCT s.store_id, a.address, a.address2, a.district, ci.city, co.country, a.postal_code,
                     st.first_name, st.last_name, date(now()) AS start_date, date(now())
FROM store s
JOIN address a  ON (s.address_id=a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id)
JOIN staff st ON (s.manager_staff_id = st.staff_id);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
2 rows affected.

[]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [49]:
%%sql
INSERT INTO factsales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT  TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer, dc.customer_key, 
        dm.movie_key, ds.store_key, p.amount
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN customer c ON (p.customer_id=c.customer_id)
JOIN dimcustomer dc ON(p.customer_id = dc.customer_id)
JOIN dimstore ds ON (c.store_id = ds.store_id)
JOIN dimmovie dm ON (i.film_id = dm.film_id)

 * postgresql://postgres:***@127.0.0.1:5432/pagila
286 rows affected.

[]

Congratulations

# STEP 6: Repeat the computation from the facts & dimension table

## 6.1 Facts Table has all the needed dimensions, no need for deep joins

In [50]:
%%time
%%sql
SELECT movie_key, date_key, customer_key, sales_amount
FROM factSales 
limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
CPU times: user 2.79 ms, sys: 1.5 ms, total: 4.29 ms
Wall time: 3.13 ms

[(164, 20200130, 7, Decimal('0.99')),
 (854, 20200201, 7, Decimal('4.99')),
 (640, 20200215, 7, Decimal('0.99')),
 (482, 20200216, 7, Decimal('7.99')),
 (547, 20200218, 7, Decimal('3.99'))]

## 6.2 Join fact table with dimensions to replace keys with attributes

As you run each cell, pay attention to the time that is printed. Which schema do you think will run faster?

##### Star Schema

In [ ]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by dimMovie.title, dimDate.month, dimCustomer.city, revenue desc;

##### 3NF Schema

In [ ]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
order by f.title, month, ci.city, revenue desc;

# Conclusion

We were able to show that:
* The star schema is easier to understand and write queries against.
* Queries with a star schema are more performant.